{
  "ls-aliases.zsh": {
    "ls": "Basic listing with directories first, show icons if possible.",
    "la": "Show all files, including hidden ones, using ls.",
    "ll": "Show a long list with group info using ls.",
    "lla": "Show all files (including hidden) in long list format.",
    "llh": "Show long list with a header row.",
    "llha": "Show all files in long list format with a header row.",
    "lt": "Display directory tree view.",
    "ltg": "Directory tree view that respects .gitignore.",
    "lta": "Directory tree view, show all files including hidden.",
    "ltag": "Directory tree view, show all files (including hidden), respect .gitignore.",
    "lr": "Recursively list all directories and files.",
    "lra": "Recursively list all files, including hidden.",
    "lone": "List one file per line.",
    "lonea": "List one file per line, including hidden files.",
    "lgit": "Show git status and info in listing.",
    "lgittree": "Show directory tree view with git info.",
    "ldirs": "List directories only, showing symlinks.",
    "lfiles": "List files only, showing symlinks.",
    "lsize": "Sort listing by file size.",
    "ltime": "Sort listing by last modified time.",
    "ltype": "Sort listing by file type.",
    "lname": "Sort listing by file name.",
    "lext": "Sort listing by file extension.",
    "ls-sort": "Sort listing using arbitrary field (Usage: ls-sort size [-a])",
    "lextend": "Show extended attributes in long listing.",
    "lctx": "Show security context in long listing.",
    "linode": "Show inode numbers in long listing.",
    "lcolor": "Show listing with colored output based on file sizes.",
    "lbig": "Show listing with binary size units.",
    "lbytes": "Show file sizes in bytes.",
    "labs": "Show absolute paths in long listing.",
    "llinks": "Show hard links in long listing.",
    "lmount": "Show mounted filesystems info (macOS/BSD/Linux).",
    "loctal": "Show file permissions in octal notation.",
    "lno": "Minimalist long listing with no extra details (no perms, size, user, time).",
    "lano": "Minimalist long listing (including hidden) with no extra details.",
    "laccess": "Show long listing sorted by access time.",
    "lcreate": "Show long listing sorted by creation time.",
    "lchange": "Show long listing sorted by change time.",
    "lall": "Show everything with all extra info (full details).",
    "dls": "Run eza as root using doas, with directories first and icons."
  },
  "navigation.zsh": {
    "...": "Go up one directory (equivalent to cd ../).",
    "....": "Go up two directories (equivalent to cd ../../).",
    ".....": "Go up three directories (equivalent to cd ../../../).",
    "......": "Go up four directories (equivalent to cd ../../../../)."
  },
  "bat.zsh": {
    "cat": "Use bat as a replacement for cat.",
    "fzfcat": "Use fzf with bat preview (line numbers, color, first 500 lines).",
    "catless": "Show file using bat with plain style and always paging.",
    "cathead": "Show file using bat with header style.",
    "catgrid": "Show file using bat with grid style.",
    "catgit": "Show file using bat with changes (git) style.",
    "catd": "Show file using bat with default style.",
    "catfull": "Show file using bat with full style.",
    "catn": "Show file using bat with numbers style."
  },
  "chezmoi.zsh": {
    "cz": "Run chezmoi (dotfiles manager) command.",
    "czcd": "Open a shell in the source directory managed by chezmoi.",
    "czd": "Show the diff between the source state and the destination state.",
    "cza": "Apply changes from chezmoi source to destination (update dotfiles).",
    "czea": "Edit a source file and immediately apply changes.",
    "czaa": "Add a file or directory to chezmoi source state.",
    "czr": "Re-add a file to chezmoi (updates source state from destination).",
    "czup": "Update chezmoi source state from upstream (pull changes) and apply.",
    "czupup": "Upgrade chezmoi to the latest version.",
    "czgen": "Generates output for use with chezmoi.",
    "czs": "Show the status of chezmoi-managed files.",
    "czrm": "Forget (remove) a file or directory from chezmoi source state.",
    "czdoc": "Run chezmoi diagnostics (doctor) to check for issues.",
    "czi": "List files and directories ignored by chezmoi.",
    "czh": "Show help for chezmoi.",
    "czx": "Render and execute a chezmoi template.",
    "czm": "List files and directories managed by chezmoi.",
    "czt": "Show chezmoi-managed files and directories as a tree.",
    "czg": "Pass git commands through to the chezmoi-managed repo."
  },
  "misc.zsh": {
    "reload": "Reload the current zsh configuration file (.zshrc).",
    "hreload": "Restart the shell by re-executing zsh.",
    "rc-cursor": "Reset the terminal cursor to its default style.",
    "j": "Jump to directories using zoxide.",
    "ji": "Interactively jump to directories using zoxide and fzf."
  }
}
